** Elisp AutoComplete
   #+BEGIN_SRC emacs-lisp
   ;;(setq tab-always-indent 'complete)
     (setq indent-tabs-mode nil)
     (add-to-list 'completion-styles 'initials t)

     (use-package macrostep
		  :ensure t
		  :pin melpa
		  :bind ("C-c e m" . macrostep-expand))

     (use-package paredit
		  :ensure t
		  :pin melpa)

     (defun generate-elisp-scratch-buffer ()
       (interactive)
       (with-current-buffer
	   (switch-to-buffer
	    (get-buffer-create "elisp-buffer"))
	 (funcall 'emacs-lisp-mode)))

     (defun switch-to-message-buffer ()
       (interactive)
       (with-current-buffer
	   (switch-to-buffer
	    (get-buffer "*Messages*")
	    (goto-char (point-max)))))

     (add-hook 'emacs-lisp-mode-hook
	       (lambda ()
		 (local-set-key (kbd "C-c e f") 'eval-defun)
		 (local-set-key (kbd "C-c e b") 'eval-buffer)
		 (local-set-key (kbd "C-c e d") 'edebug-all-defs)
		 (local-set-key (kbd "C-c e s") 'generate-elisp-scratch-buffer)
		 (local-set-key (kbd "C-c e m") 'switch-to-message-buffer)
		 (local-set-key (kbd "C-c e l") 'find-library)
		 (local-set-key (kbd "C-c e t") 'ert-run-tests-interactively)
		 (paredit-mode)
		 (local-set-key (kbd "C-<right>") 'paredit-forward-slurp-sexp)
		 (local-set-key (kbd "C-<left>") 'paredit-forward-barf-sexp)
		 (local-set-key (kbd "C-k") 'paredit-kill)

		 (setq prettify-symbols-alist
		       '(
			 ("lambda" . 955) ; λ
			 ("->" . 8594)    ; →
			 ("=>" . 8658)    ; ⇒
			 ("map" . 8614)   ; ↦
			 ))

		 ;; (setq prettify-symbols-unprettify-at-point 'right-edge)
		 (global-prettify-symbols-mode 1)
		 (setq company-minimum-prefix-length 2)
		 (add-hook 'after-save-hook 'check-parens nil t)))
   #+END_SRC

   #+RESULTS:
   | lambda | nil | (local-set-key (kbd C-c e f) (quote eval-defun)) | (local-set-key (kbd C-c e b) (quote eval-buffer)) | (local-set-key (kbd C-c e d) (quote edebug-all-defs)) | (local-set-key (kbd C-c e s) (quote generate-elisp-scratch-buffer)) | (local-set-key (kbd C-c e m) (quote switch-to-message-buffer)) | (local-set-key (kbd C-c e l) (quote find-library)) | (local-set-key (kbd C-c e t) (quote ert-run-tests-interactively)) | (paredit-mode) | (local-set-key (kbd C-<right>) (quote paredit-forward-slurp-sexp)) | (local-set-key (kbd C-<left>) (quote paredit-forward-barf-sexp)) | (local-set-key (kbd C-k) (quote paredit-kill)) | (setq prettify-symbols-alist (quote ((lambda . 955) (-> . 8594) (=> . 8658) (map . 8614)))) | (global-prettify-symbols-mode 1) | (setq company-minimum-prefix-length 2) | (add-hook (quote after-save-hook) (quote check-parens) nil t) |

* Web
  #+BEGIN_SRC emacs-lisp
    ;; Use web-mode for html, css, javascript
    (add-to-list 'auto-mode-alist '("\\.html?\\'" . web-mode))
    (add-to-list 'auto-mode-alist '("\\.css\\'" . web-mode))
    (add-to-list 'auto-mode-alist '("\\.js\\'" . web-mode))
    (add-to-list 'auto-mode-alist '("\\.php\\'" . php-mode))

    (add-hook 'web-mode-hook
	      (lambda ()
		(require 'web-mode)
		(setq web-mode-markup-indent-offset 4)
        (setq indent-tabs-mode nil)
		(setq web-mode-css-indent-offset 2)
		(setq web-mode-code-indent-offset 4)))
  #+END_SRC

  #+RESULTS:
  | lambda | nil | (require (quote web-mode)) | (setq web-mode-markup-indent-offset 4) | (setq indent-tabs-mode nil) | (setq web-mode-css-indent-offset 2) | (setq web-mode-code-indent-offset 4) |

* Python
  #+BEGIN_SRC emacs-lisp
    (setq python-shell-interpreter "ipython"
      python-shell-interpreter-args "-i --simple-prompt")
    (elpy-enable)
    (add-hook 'python-mode-hook
	      (lambda ()
		(setq indent-tabs-mode nil)
		(setq tab-width 4)
		(setq python-indent 4)))

    ;; use flycheck instead of flymake with elpy
    (when (require 'flycheck nil t)
      (setq elpy-modules (delq 'elpy-module-flymake elpy-modules))
      (add-hook 'elpy-mode-hook 'flycheck-mode))

    ;; enable autopep8 formatting on save
    (require 'py-autopep8)
    (add-hook 'elpy-mode-hook 'py-autopep8-enable-on-save)
  #+END_SRC

  #+RESULTS:
  | py-autopep8-enable-on-save | flycheck-mode |

